#1)for loop ის დახმარებით გამოიტანეთ თქვენი სახელი 50 ჯერ
for i in range(50) : 
    print("Giorgi")

#2)for loop ის დახმარებით გამოიტანეთ რიცხვები 0 იდან 100 მდე
for i in range(10) : 
    print("Giorgi")

#3)for loop ის დახმარებით გამოიტანეთ რიცხვები 0 იდან 40 ის ჩათვლით
for i in range(40) : 
    print("Giorgi")

#4)for loop ის დახმარებით გამოიტანეთ რიცხვები 10 იდან 60 მდე
for i in range(10,60) : 
    print("Giorgi")

#5)for loop ის დახმარებით გამოიტანეთ რიცხვები 50 დან 100 ის ჩათვლით
for i in range(50,101) : 
    print("Giorgi")

#6)for loop ის დახმარებით გამოიტანეთ რიცხვები 30 იდან 150 მდე 10 სტეპ ის გამოტოვებით
for i in range(30,150,10) : 
    print(i)

#7)for loop ის დახმარებით გამოიტანეთ რიცხვები 100 იდან 200 მდე 20 სტეპ ის გამოტოვებით
for i in range (100,200,20) : 
    print(i)

#8)for loop ის დახმარებით გამოიტანეთ რიცხვები 0 იდან 100 მდე 2 სტეპ ის გამოტოვებით
for i in range(0,100,2) :
    print(i)

#9)for loop ის დახმარებით გამოიტანეთ ასეთი თანმიმდევრობა :
for i in range(1,31) : 
    print(i , "giorgi")

#10)აუცილებლად გადახედეთ რესურსებს
#გადავხედე

#11)კომენტარის სახით ჩამოწერეთ ის სამი ტექნიკა რასაც კომპიუტერი იყენებს პრობლემების გადასაჭრელად კოდში,
#თითეულს მიუწერე თავიანთ ახსნა განმარტება გვერდით


#Sequences Iterations Selections 

#Sequences - თანმიმდევრობა 

#Iterations - გამეორება

#Selections - შერჩევა