#0-დან 100-მდე გამოიტანეთ ყველა რიცხვი .
#200-დან 400-მდე გამოიტანეთ ყველა 5-ის და 4-ის ჯერადი რიცხვი .
#მომხმარებელს შემოატანინეთ რიცხვი და 2-დან ამ რიცხვის ჩათვლით გამოიტანეთ ყველა რიცხვი.
#მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვიდან 0-მდე გამოიტანეთ ყველა რიცხვი უკუსვლით.
#მომხმარებელს შემოატანინეთ რიცხვი სანამ თქვენს მიერ ჩაფიქრებულ რიცხვს არ შემოიტანს.
#მომხმარებელს შემოატანინე რიცხვი, მანამ სანამ არ შემოიტანს  ტექტს - 'გამოთვალე საშუალო'. როგორც კი ამ ტექტს შემოიყვანს დაპრინტეთ ყველა შემოტანილი რიცხვის საერთო საშუალო არითმეტიკული.

#for loop -ით 
#0-დან 50-მდე გამოიტანეთ ყველა რიცხვი.
#400-დან 200-მდე უკუსვლით გამოიტანეთ ყველა რიცხვი.
#მომხმარებლის შემოტანილი რიცხვის ჩათვლით გამოიტანეთ ყველა რიცხვის კვადრატი.

#ორივე ლუპით გააკეთეთ
#მომხმარებელს შემოატანინეთ რიცხვი, ამ რიცხვის ჩათვლით შეკრიბეთ ყველა რიცხვი და გამოიტანეთ საბოლ

#while i <400 :
    #if i % 5 ==0 and i i & 4==0
    # print(i)
    #i = i + 1
#while

i=0
while i <100 : 
    print(i)
i = i + 1

